INSERT INTO stations (station_code, station_name, line, seq_on_line, region_code, region_name, lat, lon) VALUES
('0001', '서울', '경부선', 1, '11B10101', '서울', 37.554, 126.973),
('0002', '영등포', '경부선', 2, '11B10101', '서울', 37.515, 126.907),
('0003', '수원', '경부선', 3, '11B20601', '수원', 37.266, 126.999),
('0004', '천안', '경부선', 4, '11C20101', '천안', 36.810, 127.147),
('0005', '대전', '경부선', 5, '11C20401', '대전', 36.332, 127.434),
('0006', '김천(구미)', '경부선', 6, '11H10601', '김천', 36.129, 128.114),
('0007', '동대구', '경부선', 7, '11H10201', '대구', 35.879, 128.628),
('0008', '밀양', '경부선', 8, '11H20401', '밀양', 35.504, 128.746),
('0009', '부산', '경부선', 9, '11H20201', '부산', 35.115, 129.041)
ON CONFLICT (station_code) DO NOTHING;